for _ in range(int(input())):
    n = int(input())

    # 中・小・大
    a = (n - 1) * n ** 2 // 2 - (n - 1) * n * (2 * n - 1) // 6 - n * (n - 1) + (n - 1) * n // 2

    # 中・大・小
    b = n ** 2 * (n - 1) // 2 - n * (n - 1) - (n - 1) * n * (2 * n - 1) // 6 + (n - 1) * n // 2

    # 大・小・中
    c = ((n - 2) * (n - 1) * (2 * n - 3) + 3 * ((n - 2) * (n - 1))) // 12

    # 小・大・中
    d = ((n - 2) * (n - 1) * (2 * n - 3) + 3 * ((n - 2) * (n - 1))) // 12

    print(max(0, a) + max(0, b) + max(0, c) + max(0, d))